In [26]:
import pandas as pd
from sqlalchemy import create_engine

Step 1. Connect to the Postgres database in VS Code.

In [27]:
engine = create_engine(
    "postgresql://neondb_owner:npg_NVGydXqe3ar6@ep-aged-field-adcu8co8-pooler.c-2.us-east-1.aws.neon.tech/neondb?sslmode=require"
)

Step 2. Clean data

In [28]:

query = """
SELECT
  "personId",
  "Agent",
  TO_DATE("Date", 'DD/MM/YYYY') AS viewing_date
FROM viewings
WHERE "personId" IS NOT NULL;
"""
viewings_clean = pd.read_sql(query, engine)
viewings_clean.head()

   personId              Agent viewing_date
0      3191    James Gutierrez   2025-02-05
1        95  Lisa Middleton MD   2025-02-05
2       311  Lisa Middleton MD   2025-05-12
3       305  Lisa Middleton MD   2025-05-12
4        32    Michael Mendoza   2025-01-06

Step 3. Join `viewings` with `prospects`

In [29]:
query = """
SELECT
  v."Agent",
  v.viewing_date,
  v."personId",
  p."Applied",
  p."Status"
FROM (
  SELECT
    "personId",
    "Agent",
    TO_DATE("Date", 'DD/MM/YYYY') AS viewing_date
  FROM viewings
) v
LEFT JOIN prospects p
  ON v."personId" = p."personId"
WHERE v."personId" IS NOT NULL
ORDER BY v.viewing_date
LIMIT 20;
"""
joined = pd.read_sql(query, engine)
joined.head()

             Agent viewing_date  personId    Applied Status
0  Michael Mendoza   2025-01-06        32       None   None
1     Brian Cortez   2025-01-07         6       None   None
2  Michael Mendoza   2025-01-07        21       None   None
3  Michael Mendoza   2025-01-08        19       None   None
4     Brian Cortez   2025-01-08        45  14/1/2025   Past

Step 4. Aggregate Weekly by Agent

In [30]:
query = """
-- Generate a continuous list of weeks from the first to last date
WITH week_calendar AS (
  SELECT 
    generate_series(
      DATE '2025-01-06',  -- start date from your earlier query
      DATE '2025-10-08',  -- end date from your earlier query
      INTERVAL '1 week'
    )::date AS week_start
),

-- Clean the viewings data
cleaned_viewings AS (
  SELECT
    "personId",
    "Agent",
    TO_DATE("Date", 'DD/MM/YYYY') AS viewing_date
  FROM viewings
  WHERE "personId" IS NOT NULL
),

-- Aggregate weekly performance
weekly_performance AS (
  SELECT
    v."Agent" AS agent,
    DATE_TRUNC('week', v.viewing_date)::date AS week_start,
    COUNT(DISTINCT v."personId") AS total_viewings,
    COUNT(DISTINCT CASE WHEN p."Applied" IS NOT NULL THEN v."personId" END) AS applications,
    COUNT(DISTINCT CASE WHEN p."Status" = 'Current' THEN v."personId" END) AS tenants
  FROM cleaned_viewings v
  LEFT JOIN prospects p ON v."personId" = p."personId"
  GROUP BY 1, 2
)

-- Combine full calendar with agent data
SELECT
  w.week_start,
  w.week_start + INTERVAL '6 days' AS week_end,
  wp.agent,
  COALESCE(wp.total_viewings, 0) AS total_viewings,
  COALESCE(wp.applications, 0) AS applications,
  COALESCE(wp.tenants, 0) AS tenants
FROM week_calendar w
LEFT JOIN weekly_performance wp ON w.week_start = wp.week_start
ORDER BY w.week_start, wp.agent;
"""
df_full = pd.read_sql(query, engine)
df_full.head(10)

,week_start,week_end,agent,total_viewings,applications,tenants
0,2025-01-06,2025-01-12,Brian Cortez,3,1,0
1,2025-01-06,2025-01-12,Michael Mendoza,3,0,0
2,2025-01-13,2025-01-19,Brian Cortez,7,1,1
3,2025-01-13,2025-01-19,Mary Taylor,1,1,0
4,2025-01-13,2025-01-19,Michael Mendoza,1,0,0
5,2025-01-20,2025-01-26,Brian Cortez,9,1,1
6,2025-01-20,2025-01-26,Mary Taylor,1,0,0
7,2025-01-20,2025-01-26,Michael Mendoza,1,0,0
8,2025-01-20,2025-01-26,Ryan Floyd,1,0,0
9,2025-01-20,2025-01-26,Theresa Young,1,0,0

Step 5a. Total Viewings by Agent

Goal: Identify how many unique viewings each agent conducted.
This gives a clear picture of agent activity levels and the volume they handled across the dataset.

In [31]:
query = """
SELECT 
  "Agent" AS agent,
  COUNT(DISTINCT "personId") AS total_viewings
FROM viewings
WHERE "personId" IS NOT NULL
GROUP BY 1
ORDER BY total_viewings DESC;
"""
pd.read_sql(query, engine)

               agent  total_viewings
0    Michael Mendoza             427
1       Brian Cortez              65
2    Carlos Franklin              54
3        Mary Taylor              41
4      Theresa Young              29
5       Marvin Lewis              16
6         Ryan Floyd              11
7  Lisa Middleton MD               3
8    James Gutierrez               1

5b. Conversion Funnel by Agent

Goal: Measure how effectively each agent converts viewings → applications → tenants.
Includes both raw counts and stage-to-stage conversion rates (%).

In [35]:
query = """
SELECT 
  v."Agent" AS agent,
  COUNT(DISTINCT v."personId") AS total_viewings,
  COUNT(DISTINCT CASE WHEN p."Applied" IS NOT NULL THEN v."personId" END) AS applications,
  COUNT(DISTINCT CASE WHEN p."Status" = 'Current' THEN v."personId" END) AS tenants,
  ROUND(
    COUNT(DISTINCT CASE WHEN p."Applied" IS NOT NULL THEN v."personId" END)::NUMERIC /
    NULLIF(COUNT(DISTINCT v."personId"),0) * 100, 1
  ) AS view_to_app_rate,
  ROUND(
    COUNT(DISTINCT CASE WHEN p."Status" = 'Current' THEN v."personId" END)::NUMERIC /
    NULLIF(COUNT(DISTINCT CASE WHEN p."Applied" IS NOT NULL THEN v."personId" END),0) * 100, 1
  ) AS app_to_tenant_rate,
  ROUND(
    COUNT(DISTINCT CASE WHEN p."Status" = 'Current' THEN v."personId" END)::NUMERIC /
    NULLIF(COUNT(DISTINCT v."personId"),0) * 100, 1
  ) AS total_conversion_rate
FROM viewings v
LEFT JOIN prospects p ON v."personId" = p."personId"
WHERE v."personId" IS NOT NULL
GROUP BY 1
ORDER BY total_conversion_rate DESC;
"""
pd.read_sql(query, engine)

,agent,total_viewings,applications,tenants,view_to_app_rate,app_to_tenant_rate,total_conversion_rate
0,Marvin Lewis,16,10,8,62.5,80.0,50.0
1,Theresa Young,29,12,7,41.4,58.3,24.1
2,Carlos Franklin,54,28,12,51.9,42.9,22.2
3,Michael Mendoza,427,148,69,34.7,46.6,16.2
4,Mary Taylor,41,17,6,41.5,35.3,14.6
5,Brian Cortez,65,19,9,29.2,47.4,13.8
6,Ryan Floyd,11,3,1,27.3,33.3,9.1
7,James Gutierrez,1,0,0,0.0,NaN,0.0
8,Lisa Middleton MD,3,0,0,0.0,NaN,0.0

Step 5c. Weekly Performance by Agent

Goal: Track each agent’s performance week by week.
Shows how many viewings, applications, and tenants each agent achieved per week, plus their weekly conversion rates (%).

In [33]:
query = """
WITH cleaned_viewings AS (
  SELECT
    "personId",
    "Agent",
    TO_DATE("Date", 'DD/MM/YYYY') AS viewing_date
  FROM viewings
  WHERE "personId" IS NOT NULL
),
weekly AS (
  SELECT
    v."Agent" AS agent,
    DATE_TRUNC('week', v.viewing_date)::date AS week_start,
    COUNT(DISTINCT v."personId") AS total_viewings,
    COUNT(DISTINCT CASE WHEN p."Applied" IS NOT NULL THEN v."personId" END) AS applications,
    COUNT(DISTINCT CASE WHEN p."Status" = 'Current' THEN v."personId" END) AS tenants
  FROM cleaned_viewings v
  LEFT JOIN prospects p ON v."personId" = p."personId"
  GROUP BY 1,2
)
SELECT
  agent,
  week_start,
  week_start + INTERVAL '6 days' AS week_end,
  ROUND(applications::NUMERIC / NULLIF(total_viewings,0) * 100, 1) AS view_to_app_rate,
  ROUND(tenants::NUMERIC / NULLIF(applications,0) * 100, 1) AS app_to_tenant_rate,
  ROUND(tenants::NUMERIC / NULLIF(total_viewings,0) * 100, 1) AS total_conversion_rate,
  total_viewings,
  applications,
  tenants
FROM weekly
ORDER BY week_start, total_conversion_rate DESC;
"""
weekly_perf = pd.read_sql(query, engine)
weekly_perf.head(10)

,agent,week_start,week_end,view_to_app_rate,app_to_tenant_rate,total_conversion_rate,total_viewings,applications,tenants
0,Brian Cortez,2025-01-06,2025-01-12,33.3,0.0,0.0,3,1,0
1,Michael Mendoza,2025-01-06,2025-01-12,0.0,NaN,0.0,3,0,0
2,Brian Cortez,2025-01-13,2025-01-19,14.3,100.0,14.3,7,1,1
3,Michael Mendoza,2025-01-13,2025-01-19,0.0,NaN,0.0,1,0,0
4,Mary Taylor,2025-01-13,2025-01-19,100.0,0.0,0.0,1,1,0
5,Brian Cortez,2025-01-20,2025-01-26,11.1,100.0,11.1,9,1,1
6,Ryan Floyd,2025-01-20,2025-01-26,0.0,NaN,0.0,1,0,0
7,Theresa Young,2025-01-20,2025-01-26,0.0,NaN,0.0,1,0,0
8,Michael Mendoza,2025-01-20,2025-01-26,0.0,NaN,0.0,1,0,0
9,Mary Taylor,2025-01-20,2025-01-26,0.0,NaN,0.0,1,0,0

Step 6. Ranking by Weekly Conversion

In [34]:
weekly_perf.groupby('agent')['total_conversion_rate'].mean().sort_values(ascending=False)

agent
Marvin Lewis         56.670000
Theresa Young        27.777778
Carlos Franklin      19.300000
Mary Taylor          15.830000
Michael Mendoza      13.585000
Brian Cortez         11.390000
Ryan Floyd            5.000000
James Gutierrez       0.000000
Lisa Middleton MD     0.000000
Name: total_conversion_rate, dtype: float64